// const glyphs = ['ء', 'ٴ', 'ﺀ', 'ٵ', 'ٶ', 'ٷ', 'ٸ', 'آ', 'ﺂ', 'ﺁ', 'أ', 'ﺄ', 'ﺃ', 'ٲ', 'ٱ', 'ﭑ', 'ﭐ', 'ؤ', 'ﺆ', 'ﺅ', 'إ', 'ﺈ', 'ﺇ', 'ٳ', 'ئ', 'ﺋ', 'ﺌ', 'ﺊ', 'ﺉ', 'ا', 'ﺎ', 'ﺍ', 'ﷲ', 'ٮ', 'ب', 'ﺑ', 'ﺒ', 'ﺐ', 'ﺏ', 'ٻ', 'ﭔ', 'ﭕ', 'ﭓ', 'ﭒ', 'پ', 'ﭘ', 'ﭙ', 'ﭗ', 'ﭖ', 'ڀ', 'ﭜ', 'ﭝ', 'ﭛ', 'ﭚ', 'ة', 'ﺔ', 'ﺓ', 'ت', 'ﺗ', 'ﺘ', 'ﺖ', 'ﺕ', 'ث', 'ﺛ', 'ﺜ', 'ﺚ', 'ﺙ', 'ٹ', 'ﭨ', 'ﭩ', 'ﭧ', 'ﭦ', 'ٺ', 'ﭠ', 'ﭡ', 'ﭟ', 'ﭞ', 'ټ', 'ٽ', 'ٿ', 'ﭤ', 'ﭥ', 'ﭣ', 'ﭢ', 'ج', 'ﺟ', 'ﺠ', 'ﺞ', 'ﺝ', 'ڃ', 'ﭸ', 'ﭹ', 'ﭷ', 'ﭶ', 'ڄ', 'ﭴ', 'ﭵ', 'ﭳ', 'ﭲ', 'چ', 'ﭼ', 'ﭽ', 'ﭻ', 'ﭺ', 'ڿ', 'ڇ', 'ﮀ', 'ﮁ', 'ﭿ', 'ﭾ', 'ح', 'ﺣ', 'ﺤ', 'ﺢ', 'ﺡ', 'خ', 'ﺧ', 'ﺨ', 'ﺦ', 'ﺥ', 'ځ', 'ڂ', 'څ', 'د', 'ﺪ', 'ﺩ', 'ذ', 'ﺬ', 'ﺫ', 'ڈ', 'ﮉ', 'ﮈ', 'ډ', 'ڊ', 'ڋ', 'ڌ', 'ﮅ', 'ﮄ', 'ڍ', 'ﮃ', 'ﮂ', 'ڎ', 'ڏ', 'ڐ', 'ۮ', 'ر', 'ﺮ', 'ﺭ', 'ز', 'ﺰ', 'ﺯ', 'ڑ', 'ﮍ', 'ﮌ', 'ڒ', 'ړ', 'ڔ', 'ڕ', 'ږ', 'ڗ', 'ژ', 'ﮋ', 'ﮊ', 'ڙ', 'ۯ', 'س', 'ﺳ', 'ﺴ', 'ﺲ', 'ﺱ', 'ش', 'ﺷ', 'ﺸ', 'ﺶ', 'ﺵ', 'ښ', 'ڛ', 'ڜ', 'ۺ', 'ص', 'ﺻ', 'ﺼ', 'ﺺ', 'ﺹ', 'ﷺ', 'ض', 'ﺿ', 'ﻀ', 'ﺾ', 'ﺽ', 'ڝ', 'ڞ', 'ۻ', 'ط', 'ﻃ', 'ﻄ', 'ﻂ', 'ﻁ', 'ظ', 'ﻇ', 'ﻈ', 'ﻆ', 'ﻅ', 'ڟ', 'ع', 'ﻋ', 'ﻌ', 'ﻊ', 'ﻉ', 'غ', 'ﻏ', 'ﻐ', 'ﻎ', 'ﻍ', 'ڠ', 'ۼ', 'ف', 'ﻓ', 'ﻔ', 'ﻒ', 'ﻑ', 'ڡ', 'ڢ', 'ڣ', 'ڤ', 'ﭬ', 'ﭭ', 'ﭫ', 'ﭪ', 'ڥ', 'ڦ', 'ﭰ', 'ﭱ', 'ﭯ', 'ﭮ', 'ٯ', 'ق', 'ﻗ', 'ﻘ', 'ﻖ', 'ﻕ', 'ڧ', 'ڨ', 'ك', 'ﻛ', 'ﻜ', 'ﻚ', 'ﻙ', 'ک', 'ﮐ', 'ﮑ', 'ﮏ', 'ﮎ', 'ڪ', 'ګ', 'ڬ', 'ڭ', 'ڮ', 'گ', 'ﮔ', 'ﮕ', 'ﮓ', 'ﮒ', 'ڰ', 'ڱ', 'ﮜ', 'ﮝ', 'ﮛ', 'ﮚ', 'ڲ', 'ڳ', 'ﮘ', 'ﮙ', 'ﮗ', 'ﮖ', 'ڴ', 'ػ', 'ؼ', 'ل', 'ﻟ', 'ﻠ', 'ﻞ', 'ﻝ', 'ﻶ', 'ﻵ', 'ﻸ', 'ﻷ', 'ﻺ', 'ﻹ', 'ﻼ', 'ﻻ', 'ڵ', 'ڶ', 'ڷ', 'ڸ', 'م', 'ﻣ', 'ﻤ', 'ﻢ', 'ﻡ', 'ن', 'ﻧ', 'ﻨ', 'ﻦ', 'ﻥ', 'ں', 'ﮟ', 'ﮞ', 'ڻ', 'ﮢ', 'ﮣ', 'ﮡ', 'ﮠ', 'ڼ', 'ڽ', 'ڹ', 'ه', 'ﻫ', 'ﻬ', 'ﻪ', 'ﻩ', 'ھ', 'ﮬ', 'ﮭ', 'ﮫ', 'ﮪ', 'ہ', 'ﮨ', 'ﮩ', 'ﮧ', 'ﮦ', 'ۂ', 'ۃ', 'ۿ', 'ە', 'ۀ', 'ﮥ', 'ﮤ', 'و', 'ۥ', 'ﻮ', 'ﻭ', 'ۄ', 'ۅ', 'ۆ', 'ۇ', 'ۈ', 'ۉ', 'ۊ', 'ۋ', 'ۏ', 'ى', 'ﯨ', 'ﯩ', 'ﻰ', 'ﻯ', 'ي', 'ۦ', 'ﻳ', 'ﻴ', 'ﻲ', 'ﻱ', 'ی', 'ﯾ', 'ﯿ', 'ﯽ', 'ﯼ', 'ۍ', 'ێ', 'ې', 'ﯦ', 'ﯧ', 'ﯥ', 'ﯤ', 'ۑ', 'ؽ', 'ؾ', 'ؿ', 'ؠ', 'ے', 'ﮯ', 'ﮮ', 'ۓ', 'ﮱ', 'ﮰ', '؈', '؎', '؏', '۞', '۩', '﷽', '؆', '؇', '؋', '﷼', '۽', '۾']
// const fat7achars = ['اَ', 'بَ', 'ت', 'ث', 'ج', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ق', 'ل', 'م', 'ن', 'ه', 'و', 'ي']
// const chars = ['ا', 'ب', 'ت', 'ث', 'ج', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ق', 'ل', 'م', 'ن', 'ه', 'و', 'ي']
// const punctutation = ['َ', 'رَ', 'لَ', 'لَا', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '']
// const waslChars = ['ب', 'ت', 'ث', 'ج', 'ح', 'خ', 'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ق', 'ل', 'م', 'ن', 'ه', 'ي']
// const kat3Chars = ['ا', 'د', 'ذ', 'ر', 'ز', 'و', ' ']

export function fix (text, logger) {
  return fixLa(fixPunctuation(text, logger), logger)
}

function fixPunctuation (text, logger) {
  return text
}

function fixLa (text, logger) {
  return text
  // return text.replaceAll('لَا', 'لا')
  // let start = 0
  // let idx = text.indexOf('لَا', start)
  // logger.log('text' + idx + '=' + text)
  // while (idx > -1) {
  //   logger.log('text' + idx + '=' + text)
  //   start = idx
  //   idx = text.indexOf('لا', start)
  //   if (isKat3(text.charAt(idx - 1)) && isKat3(text.charAt(idx + 3))) {
  //     text = spliceSlice(text, idx, 3, 'ﻻ')
  //   }
  // }
  //
  // return text
}

// function isWasl (char) {
//   return char.length === 1 && waslChars.indexOf(char) > -1
// }
//
// function isKat3 (char) {
//   return char.length === 1 && kat3Chars.indexOf(char) > -1
// }
//
// function spliceSlice (str, index, count, add) {
//   // We cannot pass negative indexes directly to the 2nd slicing operation.
//   if (index < 0) {
//     index = str.length + index
//     if (index < 0) {
//       index = 0
//     }
//   }
//
//   return str.slice(0, index) + (add || '') + str.slice(index + count)
// }
